Public_SOAP_APIs/Temperature/imported_from_collection.http

#!/usr/bin/env dothttp

// Converts celsius temperature to farenheit.
@name("Celsius to Farenheit Conversion")
POST "https://www.w3schools.com/xml/tempconvert.asmx"
"Content-Type": "application/soap+xml; charset=utf-8"
data('<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/">
      <Celsius>20</Celsius>
    </CelsiusToFahrenheit>
  </soap12:Body>
</soap12:Envelope>')


// Converts farenheit temperature to celsius.
@name("Farenheit to Celsius Conversion")
POST "https://www.w3schools.com/xml/tempconvert.asmx"
"Content-Type": "application/soap+xml; charset=utf-8"
data('<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <FahrenheitToCelsius xmlns="https://www.w3schools.com/xml/">
      <Fahrenheit>75</Fahrenheit>
    </FahrenheitToCelsius>
  </soap12:Body>
</soap12:Envelope>')



